* Import `pandas` and name as alias `pd`

In [89]:
import pandas as pd

* Created a new variable `sales_df` and set it equal to the imported file `alphredgraph_sales_in_millions.csv`

In [90]:
sales_df = pd.read_csv('alphredgraph_sales_in_millions.csv')
sales_df.head()

         DATE  MRTSSM7225USN_20230118  MRTSSM7225USN_20230215
0  2019-01-01                   50003                   50003
1  2019-02-01                   49740                   49740
2  2019-03-01                   57912                   57912
3  2019-04-01                   55371                   55371
4  2019-05-01                   59375                   59375

* Renamed column(s) `MRTSSM7225USN_20230215` and `DATE` to `sales in millions` and `year` to make compatable for joining other .csv files

In [91]:
renamed_to_millions = sales_df.rename(columns={"MRTSSM7225USN_20230215": "sales in millions",
                                         "DATE":"year"})
renamed_to_millions.head()

         year  MRTSSM7225USN_20230118  sales in millions
0  2019-01-01                   50003              50003
1  2019-02-01                   49740              49740
2  2019-03-01                   57912              57912
3  2019-04-01                   55371              55371
4  2019-05-01                   59375              59375

* Created new column to change data in millions to trillions and set it equal to `new_df`

In [92]:
renamed_to_millions["sale in trillions"]= renamed_to_millions["sales in millions"] * .001
renamed_to_millions.head()

         year  MRTSSM7225USN_20230118  sales in millions  sale in trillions
0  2019-01-01                   50003              50003             50.003
1  2019-02-01                   49740              49740             49.740
2  2019-03-01                   57912              57912             57.912
3  2019-04-01                   55371              55371             55.371
4  2019-05-01                   59375              59375             59.375

* Converting  `sale in trillions` datatype to string in order to limit the decimal points and renaming column `sales in trillion`

In [93]:
renamed_to_millions["sales in trillion"] = renamed_to_millions["sale in trillions"].astype(str).str[0:5]
renamed_to_millions.head()

,year,MRTSSM7225USN_20230118,sales in millions,sale in trillions,sales in trillion
0,2019-01-01,50003,50003,50.003,50.00
1,2019-02-01,49740,49740,49.740,49.74
2,2019-03-01,57912,57912,57.912,57.91
3,2019-04-01,55371,55371,55.371,55.37
4,2019-05-01,59375,59375,59.375,59.37

* Converting `sales in trillion` column value datatypes to float64 and renaming to `sales in trillions` for easier use in future tableau visulizations

In [94]:
renamed_to_millions["sales in trillions"] = renamed_to_millions["sales in trillion"].astype(float)
renamed_to_millions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 6 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   year                    46 non-null     object
 1   MRTSSM7225USN_20230118  46 non-null     int64
 2   sales in millions       46 non-null     int64
 3   sale in trillions       46 non-null     float64
 4   sales in trillion       46 non-null     object
 5   sales in trillions      46 non-null     float64
dtypes: float64(2), int64(2), object(2)
memory usage: 2.3+ KB

* Dropped `sales in millions` column to clean unwanted data

In [95]:
dropped_col_df = renamed_to_millions.drop(["sales in millions"], axis=1)
dropped_col_df.head()

,year,MRTSSM7225USN_20230118,sale in trillions,sales in trillion,sales in trillions
0,2019-01-01,50003,50.003,50.00,50.00
1,2019-02-01,49740,49.740,49.74,49.74
2,2019-03-01,57912,57.912,57.91,57.91
3,2019-04-01,55371,55.371,55.37,55.37
4,2019-05-01,59375,59.375,59.37,59.37

* Dropped `MRTSSM7225USN_20230118` column to clean unwanted data

In [96]:
dropped_second_col_df = dropped_col_df.drop(["MRTSSM7225USN_20230118"], axis=1)
dropped_second_col_df.head()

         year  sale in trillions sales in trillion  sales in trillions
0  2019-01-01             50.003             50.00               50.00
1  2019-02-01             49.740             49.74               49.74
2  2019-03-01             57.912             57.91               57.91
3  2019-04-01             55.371             55.37               55.37
4  2019-05-01             59.375             59.37               59.37

* Dropped `sale in trillions` column to clean unwanted data

In [97]:
dropped_third_col_df = dropped_second_col_df.drop(["sale in trillions"], axis=1)
dropped_third_col_df.head()

         year sales in trillion  sales in trillions
0  2019-01-01             50.00               50.00
1  2019-02-01             49.74               49.74
2  2019-03-01             57.91               57.91
3  2019-04-01             55.37               55.37
4  2019-05-01             59.37               59.37

* Dropped `sales in trillion` column to clean unwanted data

In [98]:
dropped_fourth_col_df = dropped_third_col_df.drop(["sales in trillion"], axis=1)
dropped_fourth_col_df.head()

         year  sales in trillions
0  2019-01-01               50.00
1  2019-02-01               49.74
2  2019-03-01               57.91
3  2019-04-01               55.37
4  2019-05-01               59.37

* Changed `dropped_fourth_col-df` variable name to `new_df` variable name for easier future coding

In [99]:
new_df = dropped_fourth_col_df
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   year                46 non-null     object
 1   sales in trillions  46 non-null     float64
dtypes: float64(1), object(1)
memory usage: 864.0+ bytes

* Changed `datatype` of `year` column to `datetime64[ns]`

In [100]:
new_df["year"] = pd.to_datetime(new_df["year"])
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   year                46 non-null     datetime64[ns]
 1   sales in trillions  46 non-null     float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 864.0 bytes

* Specified the four digit year only for data in `year` column

In [101]:
new_df["year"] = new_df["year"].dt.strftime('%Y')
new_df.head()

   year  sales in trillions
0  2019               50.00
1  2019               49.74
2  2019               57.91
3  2019               55.37
4  2019               59.37

* Converted cleaned data frame to `clean_sales_trillions.csv` file and exported.

In [102]:
new_df.to_csv("clean_sales_trillions.csv", encoding="utf-8", index=False)